Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_ltdc.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     stm32U5Gx_ltdc equates.
 */

#pragma once

#include    <stdint.h>

// LTDC address definitions
// ------------------------

#ifndef ADDITIONAL_LTDC_S
typedef struct {
    volatile    uint32_t    RESERVED0[2];
    volatile    uint32_t    SSCR;
    volatile    uint32_t    BPCR;
    volatile    uint32_t    AWCR;
    volatile    uint32_t    TWCR;
    volatile    uint32_t    GCR;
    volatile    uint32_t    RESERVED1[2];
    volatile    uint32_t    SRCR;
    volatile    uint32_t    RESERVED2;
    volatile    uint32_t    BCCR;
    volatile    uint32_t    RESERVED3;
    volatile    uint32_t    IER;
    volatile    uint32_t    ISR;
    volatile    uint32_t    ICR;
    volatile    uint32_t    LIPCR;
    volatile    uint32_t    CPSR;
    volatile    uint32_t    CDSR;
    volatile    uint32_t    RESERVED4[14];
    volatile    uint32_t    L1CR;
    volatile    uint32_t    L1WHPCR;
    volatile    uint32_t    L1WVPCR;
    volatile    uint32_t    L1CKCR;
    volatile    uint32_t    L1PFCR;
    volatile    uint32_t    L1CACR;
    volatile    uint32_t    L1DCCR;
    volatile    uint32_t    L1BFCR;
    volatile    uint32_t    RESERVED5[2];
    volatile    uint32_t    L1CFBAR;
    volatile    uint32_t    L1CFBLR;
    volatile    uint32_t    L1CFBLNR;
    volatile    uint32_t    RESERVED6[3];
    volatile    uint32_t    L1CLUTWR;
    volatile    uint32_t    RESERVED7[15];
    volatile    uint32_t    L2CR;
    volatile    uint32_t    L2WHPCR;
    volatile    uint32_t    L2WVPCR;
    volatile    uint32_t    L2CKCR;
    volatile    uint32_t    L2PFCR;
    volatile    uint32_t    L2CACR;
    volatile    uint32_t    L2DCCR;
    volatile    uint32_t    L2BFCR;
    volatile    uint32_t    RESERVED8[2];
    volatile    uint32_t    L2CFBAR;
    volatile    uint32_t    L2CFBLR;
    volatile    uint32_t    L2CFBLNR;
    volatile    uint32_t    RESERVED9[3];
    volatile    uint32_t    L2CLUTWR;
} LTDC_TypeDef;

#ifdef __cplusplus
#define LTDC_NS reinterpret_cast<LTDC_TypeDef *>(0x40016800U)
#define LTDC_S  reinterpret_cast<LTDC_TypeDef *>(0x50016800U)

#else
#define LTDC_NS ((LTDC_TypeDef *)0x40016800U)
#define LTDC_S  ((LTDC_TypeDef *)0x50016800U)
#endif
#endif

// SSCR Configuration

#define LTDC_SSCR_HSW           (0xFFFU<<16)
#define LTDC_SSCR_HSW_0         (0x1U<<16)
#define LTDC_SSCR_VSH           (0x7FFU<<0)
#define LTDC_SSCR_VSH_0         (0x1U<<0)

// BPCR Configuration

#define LTDC_BPCR_AHBP          (0xFFFU<<16)
#define LTDC_BPCR_AHBP_0        (0x1U<<16)
#define LTDC_BPCR_AVBP          (0x7FFU<<0)
#define LTDC_BPCR_AVBP_0        (0x1U<<0)

// AWCR Configuration

#define LTDC_AWCR_AAW           (0xFFFU<<16)
#define LTDC_AWCR_AAW_0         (0x1U<<16)
#define LTDC_AWCR_AAH           (0x7FFU<<0)
#define LTDC_AWCR_AAH_0         (0x1U<<0)

// TWCR Configuration

#define LTDC_TWCR_TOTALW        (0xFFFU<<16)
#define LTDC_TWCR_TOTALW_0      (0x1U<<16)
#define LTDC_TWCR_TOTALH        (0x7FFU<<0)
#define LTDC_TWCR_TOTALH_0      (0x1U<<0)

// GCR Configuration

#define LTDC_GCR_HSPOL          (0x1U<<31)
#define LTDC_GCR_VSPOL          (0x1U<<30)
#define LTDC_GCR_DEPOL          (0x1U<<29)
#define LTDC_GCR_PCPOL          (0x1U<<28)
#define LTDC_GCR_DEN            (0x1U<<16)
#define LTDC_GCR_DRW            (0x7U<<12)
#define LTDC_GCR_DRW_0          (0x1U<<12)
#define LTDC_GCR_DGW            (0x7U<<8)
#define LTDC_GCR_DGW_0          (0x1U<<8)
#define LTDC_GCR_DBW            (0x7U<<4)
#define LTDC_GCR_DBW_0          (0x1U<<4)
#define LTDC_GCR_LTDCEN         (0x1U<<0)
#define LTDC_GCR_HSPOL_B_0X0    (0x0U<<31)
#define LTDC_GCR_HSPOL_B_0X1    (0x1U<<31)
#define LTDC_GCR_VSPOL_B_0X0    (0x0U<<30)
#define LTDC_GCR_VSPOL_B_0X1    (0x1U<<30)
#define LTDC_GCR_DEPOL_B_0X0    (0x0U<<29)
#define LTDC_GCR_DEPOL_B_0X1    (0x1U<<29)
#define LTDC_GCR_PCPOL_B_0X0    (0x0U<<28)
#define LTDC_GCR_PCPOL_B_0X1    (0x1U<<28)
#define LTDC_GCR_DEN_B_0X0      (0x0U<<16)
#define LTDC_GCR_DEN_B_0X1      (0x1U<<16)
#define LTDC_GCR_LTDCEN_B_0X0   (0x0U<<0)
#define LTDC_GCR_LTDCEN_B_0X1   (0x1U<<0)

// SRCR Configuration

#define LTDC_SRCR_VBR           (0x1U<<1)
#define LTDC_SRCR_IMR           (0x1U<<0)
#define LTDC_SRCR_VBR_B_0X0     (0x0U<<1)
#define LTDC_SRCR_VBR_B_0X1     (0x1U<<1)
#define LTDC_SRCR_IMR_B_0X0     (0x0U<<0)
#define LTDC_SRCR_IMR_B_0X1     (0x1U<<0)

// BCCR Configuration

#define LTDC_BCCR_BCRED         (0xFFU<<16)
#define LTDC_BCCR_BCRED_0       (0x1U<<16)
#define LTDC_BCCR_BCGREEN       (0xFFU<<8)
#define LTDC_BCCR_BCGREEN_0     (0x1U<<8)
#define LTDC_BCCR_BCBLUE        (0xFFU<<0)
#define LTDC_BCCR_BCBLUE_0      (0x1U<<0)

// IER Configuration

#define LTDC_IER_RRIE           (0x1U<<3)
#define LTDC_IER_TERRIE         (0x1U<<2)
#define LTDC_IER_FUIE           (0x1U<<1)
#define LTDC_IER_LIE            (0x1U<<0)
#define LTDC_IER_RRIE_B_0X0     (0x0U<<3)
#define LTDC_IER_RRIE_B_0X1     (0x1U<<3)
#define LTDC_IER_TERRIE_B_0X0   (0x0U<<2)
#define LTDC_IER_TERRIE_B_0X1   (0x1U<<2)
#define LTDC_IER_FUIE_B_0X0     (0x0U<<1)
#define LTDC_IER_FUIE_B_0X1     (0x1U<<1)
#define LTDC_IER_LIE_B_0X0      (0x0U<<0)
#define LTDC_IER_LIE_B_0X1      (0x1U<<0)

// ISR Configuration

#define LTDC_ISR_RRIF           (0x1U<<3)
#define LTDC_ISR_TERRIF         (0x1U<<2)
#define LTDC_ISR_FUIF           (0x1U<<1)
#define LTDC_ISR_LIF            (0x1U<<0)
#define LTDC_ISR_RRIF_B_0X0     (0x0U<<3)
#define LTDC_ISR_RRIF_B_0X1     (0x1U<<3)
#define LTDC_ISR_TERRIF_B_0X0   (0x0U<<2)
#define LTDC_ISR_TERRIF_B_0X1   (0x1U<<2)
#define LTDC_ISR_FUIF_B_0X0     (0x0U<<1)
#define LTDC_ISR_FUIF_B_0X1     (0x1U<<1)
#define LTDC_ISR_LIF_B_0X0      (0x0U<<0)
#define LTDC_ISR_LIF_B_0X1      (0x1U<<0)

// ICR Configuration

#define LTDC_ICR_CRRIF          (0x1U<<3)
#define LTDC_ICR_CTERRIF        (0x1U<<2)
#define LTDC_ICR_CFUIF          (0x1U<<1)
#define LTDC_ICR_CLIF           (0x1U<<0)
#define LTDC_ICR_CRRIF_B_0X0    (0x0U<<3)
#define LTDC_ICR_CRRIF_B_0X1    (0x1U<<3)
#define LTDC_ICR_CTERRIF_B_0X0  (0x0U<<2)
#define LTDC_ICR_CTERRIF_B_0X1  (0x1U<<2)
#define LTDC_ICR_CFUIF_B_0X0    (0x0U<<1)
#define LTDC_ICR_CFUIF_B_0X1    (0x1U<<1)
#define LTDC_ICR_CLIF_B_0X0     (0x0U<<0)
#define LTDC_ICR_CLIF_B_0X1     (0x1U<<0)

// LIPCR Configuration

#define LTDC_LIPCR_LIPOS        (0x7FFU<<0)
#define LTDC_LIPCR_LIPOS_0      (0x1U<<0)

// CPSR Configuration

#define LTDC_CPSR_CXPOS         (0xFFFFU<<16)
#define LTDC_CPSR_CXPOS_0       (0x1U<<16)
#define LTDC_CPSR_CYPOS         (0xFFFFU<<0)
#define LTDC_CPSR_CYPOS_0       (0x1U<<0)

// CDSR Configuration

#define LTDC_CDSR_HSYNCS        (0x1U<<3)
#define LTDC_CDSR_VSYNCS        (0x1U<<2)
#define LTDC_CDSR_HDES          (0x1U<<1)
#define LTDC_CDSR_VDES          (0x1U<<0)
#define LTDC_CDSR_HSYNCS_B_0X0  (0x0U<<3)
#define LTDC_CDSR_HSYNCS_B_0X1  (0x1U<<3)
#define LTDC_CDSR_VSYNCS_B_0X0  (0x0U<<2)
#define LTDC_CDSR_VSYNCS_B_0X1  (0x1U<<2)
#define LTDC_CDSR_HDES_B_0X0    (0x0U<<1)
#define LTDC_CDSR_HDES_B_0X1    (0x1U<<1)
#define LTDC_CDSR_VDES_B_0X0    (0x0U<<0)
#define LTDC_CDSR_VDES_B_0X1    (0x1U<<0)

// L1CR Configuration

#define LTDC_L1CR_CLUTEN        (0x1U<<4)
#define LTDC_L1CR_COLKEN        (0x1U<<1)
#define LTDC_L1CR_LEN           (0x1U<<0)
#define LTDC_L1CR_CLUTEN_B_0X0  (0x0U<<4)
#define LTDC_L1CR_CLUTEN_B_0X1  (0x1U<<4)
#define LTDC_L1CR_COLKEN_B_0X0  (0x0U<<1)
#define LTDC_L1CR_COLKEN_B_0X1  (0x1U<<1)
#define LTDC_L1CR_LEN_B_0X0     (0x0U<<0)
#define LTDC_L1CR_LEN_B_0X1     (0x1U<<0)

// L1WHPCR Configuration

#define LTDC_L1WHPCR_WHSPPOS    (0xFFFU<<16)
#define LTDC_L1WHPCR_WHSPPOS_0  (0x1U<<16)
#define LTDC_L1WHPCR_WHSTPOS    (0xFFFU<<0)
#define LTDC_L1WHPCR_WHSTPOS_0  (0x1U<<0)

// L1WVPCR Configuration

#define LTDC_L1WVPCR_WVSPPOS    (0x7FFU<<16)
#define LTDC_L1WVPCR_WVSPPOS_0  (0x1U<<16)
#define LTDC_L1WVPCR_WVSTPOS    (0x7FFU<<0)
#define LTDC_L1WVPCR_WVSTPOS_0  (0x1U<<0)

// L1CKCR Configuration

#define LTDC_L1CKCR_CKRED       (0xFFU<<16)
#define LTDC_L1CKCR_CKRED_0     (0x1U<<16)
#define LTDC_L1CKCR_CKGREEN     (0xFFU<<8)
#define LTDC_L1CKCR_CKGREEN_0   (0x1U<<8)
#define LTDC_L1CKCR_CKBLUE      (0xFFU<<0)
#define LTDC_L1CKCR_CKBLUE_0    (0x1U<<0)

// L1PFCR Configuration

#define LTDC_L1PFCR_PF          (0x7U<<0)
#define LTDC_L1PFCR_PF_0        (0x1U<<0)
#define LTDC_L1PFCR_PF_B_0X0    (0x0U<<0)
#define LTDC_L1PFCR_PF_B_0X1    (0x1U<<0)
#define LTDC_L1PFCR_PF_B_0X2    (0x2U<<0)
#define LTDC_L1PFCR_PF_B_0X3    (0x3U<<0)
#define LTDC_L1PFCR_PF_B_0X4    (0x4U<<0)
#define LTDC_L1PFCR_PF_B_0X5    (0x5U<<0)
#define LTDC_L1PFCR_PF_B_0X6    (0x6U<<0)
#define LTDC_L1PFCR_PF_B_0X7    (0x7U<<0)

// L1CACR Configuration

#define LTDC_L1CACR_CONSTA      (0xFFU<<0)
#define LTDC_L1CACR_CONSTA_0    (0x1U<<0)

// L1DCCR Configuration

#define LTDC_L1DCCR_DCALPHA     (0xFFU<<24)
#define LTDC_L1DCCR_DCALPHA_0   (0x1U<<24)
#define LTDC_L1DCCR_DCRED       (0xFFU<<16)
#define LTDC_L1DCCR_DCRED_0     (0x1U<<16)
#define LTDC_L1DCCR_DCGREEN     (0xFFU<<8)
#define LTDC_L1DCCR_DCGREEN_0   (0x1U<<8)
#define LTDC_L1DCCR_DCBLUE      (0xFFU<<0)
#define LTDC_L1DCCR_DCBLUE_0    (0x1U<<0)

// L1BFCR Configuration

#define LTDC_L1BFCR_BF1         (0x7U<<8)
#define LTDC_L1BFCR_BF1_0       (0x1U<<8)
#define LTDC_L1BFCR_BF2         (0x7U<<0)
#define LTDC_L1BFCR_BF2_0       (0x1U<<0)
#define LTDC_L1BFCR_BF1_B_0X4   (0x4U<<8)
#define LTDC_L1BFCR_BF1_B_0X6   (0x6U<<8)
#define LTDC_L1BFCR_BF2_B_0X5   (0x5U<<0)
#define LTDC_L1BFCR_BF2_B_0X7   (0x7U<<0)

// L1CFBAR Configuration

#define LTDC_L1CFBAR_CFBADD     (0xFFFFFFFFU<<0)
#define LTDC_L1CFBAR_CFBADD_0   (0x1U<<0)

// L1CFBLR Configuration

#define LTDC_L1CFBLR_CFBP       (0x1FFFU<<16)
#define LTDC_L1CFBLR_CFBP_0     (0x1U<<16)
#define LTDC_L1CFBLR_CFBLL      (0x1FFFU<<0)
#define LTDC_L1CFBLR_CFBLL_0    (0x1U<<0)

// L1CFBLNR Configuration

#define LTDC_L1CFBLNR_CFBLNBR   (0x7FFU<<0)
#define LTDC_L1CFBLNR_CFBLNBR_0 (0x1U<<0)

// L1CLUTWR Configuration

#define LTDC_L1CLUTWR_CLUTADD   (0xFFU<<24)
#define LTDC_L1CLUTWR_CLUTADD_0 (0x1U<<24)
#define LTDC_L1CLUTWR_RED       (0xFFU<<16)
#define LTDC_L1CLUTWR_RED_0     (0x1U<<16)
#define LTDC_L1CLUTWR_GREEN     (0xFFU<<8)
#define LTDC_L1CLUTWR_GREEN_0   (0x1U<<8)
#define LTDC_L1CLUTWR_BLUE      (0xFFU<<0)
#define LTDC_L1CLUTWR_BLUE_0    (0x1U<<0)

// L2CR Configuration

#define LTDC_L2CR_CLUTEN        (0x1U<<4)
#define LTDC_L2CR_COLKEN        (0x1U<<1)
#define LTDC_L2CR_LEN           (0x1U<<0)
#define LTDC_L2CR_CLUTEN_B_0X0  (0x0U<<4)
#define LTDC_L2CR_CLUTEN_B_0X1  (0x1U<<4)
#define LTDC_L2CR_COLKEN_B_0X0  (0x0U<<1)
#define LTDC_L2CR_COLKEN_B_0X1  (0x1U<<1)
#define LTDC_L2CR_LEN_B_0X0     (0x0U<<0)
#define LTDC_L2CR_LEN_B_0X1     (0x1U<<0)

// L2WHPCR Configuration

#define LTDC_L2WHPCR_WHSPPOS    (0xFFFU<<16)
#define LTDC_L2WHPCR_WHSPPOS_0  (0x1U<<16)
#define LTDC_L2WHPCR_WHSTPOS    (0xFFFU<<0)
#define LTDC_L2WHPCR_WHSTPOS_0  (0x1U<<0)

// L2WVPCR Configuration

#define LTDC_L2WVPCR_WVSPPOS    (0x7FFU<<16)
#define LTDC_L2WVPCR_WVSPPOS_0  (0x1U<<16)
#define LTDC_L2WVPCR_WVSTPOS    (0x7FFU<<0)
#define LTDC_L2WVPCR_WVSTPOS_0  (0x1U<<0)

// L2CKCR Configuration

#define LTDC_L2CKCR_CKRED       (0xFFU<<16)
#define LTDC_L2CKCR_CKRED_0     (0x1U<<16)
#define LTDC_L2CKCR_CKGREEN     (0xFFU<<8)
#define LTDC_L2CKCR_CKGREEN_0   (0x1U<<8)
#define LTDC_L2CKCR_CKBLUE      (0xFFU<<0)
#define LTDC_L2CKCR_CKBLUE_0    (0x1U<<0)

// L2PFCR Configuration

#define LTDC_L2PFCR_PF          (0x7U<<0)
#define LTDC_L2PFCR_PF_0        (0x1U<<0)
#define LTDC_L2PFCR_PF_B_0X0    (0x0U<<0)
#define LTDC_L2PFCR_PF_B_0X1    (0x1U<<0)
#define LTDC_L2PFCR_PF_B_0X2    (0x2U<<0)
#define LTDC_L2PFCR_PF_B_0X3    (0x3U<<0)
#define LTDC_L2PFCR_PF_B_0X4    (0x4U<<0)
#define LTDC_L2PFCR_PF_B_0X5    (0x5U<<0)
#define LTDC_L2PFCR_PF_B_0X6    (0x6U<<0)
#define LTDC_L2PFCR_PF_B_0X7    (0x7U<<0)

// L2CACR Configuration

#define LTDC_L2CACR_CONSTA      (0xFFU<<0)
#define LTDC_L2CACR_CONSTA_0    (0x1U<<0)

// L2DCCR Configuration

#define LTDC_L2DCCR_DCALPHA     (0xFFU<<24)
#define LTDC_L2DCCR_DCALPHA_0   (0x1U<<24)
#define LTDC_L2DCCR_DCRED       (0xFFU<<16)
#define LTDC_L2DCCR_DCRED_0     (0x1U<<16)
#define LTDC_L2DCCR_DCGREEN     (0xFFU<<8)
#define LTDC_L2DCCR_DCGREEN_0   (0x1U<<8)
#define LTDC_L2DCCR_DCBLUE      (0xFFU<<0)
#define LTDC_L2DCCR_DCBLUE_0    (0x1U<<0)

// L2BFCR Configuration

#define LTDC_L2BFCR_BF1         (0x7U<<8)
#define LTDC_L2BFCR_BF1_0       (0x1U<<8)
#define LTDC_L2BFCR_BF2         (0x7U<<0)
#define LTDC_L2BFCR_BF2_0       (0x1U<<0)
#define LTDC_L2BFCR_BF1_B_0X4   (0x4U<<8)
#define LTDC_L2BFCR_BF1_B_0X6   (0x6U<<8)
#define LTDC_L2BFCR_BF2_B_0X5   (0x5U<<0)
#define LTDC_L2BFCR_BF2_B_0X7   (0x7U<<0)

// L2CFBAR Configuration

#define LTDC_L2CFBAR_CFBADD     (0xFFFFFFFFU<<0)
#define LTDC_L2CFBAR_CFBADD_0   (0x1U<<0)

// L2CFBLR Configuration

#define LTDC_L2CFBLR_CFBP       (0x1FFFU<<16)
#define LTDC_L2CFBLR_CFBP_0     (0x1U<<16)
#define LTDC_L2CFBLR_CFBLL      (0x1FFFU<<0)
#define LTDC_L2CFBLR_CFBLL_0    (0x1U<<0)

// L2CFBLNR Configuration

#define LTDC_L2CFBLNR_CFBLNBR   (0x7FFU<<0)
#define LTDC_L2CFBLNR_CFBLNBR_0 (0x1U<<0)

// L2CLUTWR Configuration

#define LTDC_L2CLUTWR_CLUTADD   (0xFFU<<24)
#define LTDC_L2CLUTWR_CLUTADD_0 (0x1U<<24)
#define LTDC_L2CLUTWR_RED       (0xFFU<<16)
#define LTDC_L2CLUTWR_RED_0     (0x1U<<16)
#define LTDC_L2CLUTWR_GREEN     (0xFFU<<8)
#define LTDC_L2CLUTWR_GREEN_0   (0x1U<<8)
#define LTDC_L2CLUTWR_BLUE      (0xFFU<<0)
#define LTDC_L2CLUTWR_BLUE_0    (0x1U<<0)
